#+SETUPFILE: .orgconfig
#+NAME: setup
#+BEGIN_SRC emacs-lisp :results silent
  (require 'emir)

  (defun emir--provide-issues (&optional exclude-shelved)
    (let (alist body)
      (dolist (name (if (not exclude-shelved)
                        (epkgs 'name)
                      (epkgs 'name '(epkg-mirrored-package--eieio-childp
                                     epkg-builtin-package-p))))
        (dolist (feature (epkg-sql [:select feature :from provided
                                    :where (and (= package $s1)
                                                (isnull drop))]
                                   name))
          (setq feature (car feature))
          (-if-let (elt (assq feature alist))
              (push name (cdr elt))
            (cl-pushnew (list feature name) alist))))
      (setq body
            (-mapcat (-lambda ((feature . providers))
                       (and (> (length providers) 1)
                            (list (list feature providers))
                            (--map (list feature it)
                                   (sort providers #'string<))))
                     (cl-sort alist #'string< :key #'car)))
      (if (not exclude-shelved)
          (emir--with-org-header ("Feature" "Package" "Shelved")
            (mapcar (-lambda ((feature package))
                      (list feature package
                            (or (epkg-shelved-package-p (epkg package)) "")))
                    body))
        (emir--with-org-header ("Feature" "Package")
          body))))

  (defun emir--require-issues (pred where)
    (emir--with-org-header ("Package" "Type" "Melpa" "Feature")
      (-mapcat
       (-lambda ((name class))
         (let (features)
           (dolist (feature
                    (epkg-sql (vconcat [:select feature :from required :where]
                                       `((and (= package $s1) ,@where))
                                       [:order-by [(asc feature)]])
                              name))
             (setq feature (car feature))
             (when (funcall pred feature)
               (push feature features)))
           (mapcar (lambda (feature)
                     (list name class
                           (or (emir--melpa-get name 'fetcher) "")
                           feature))
                   (sort features #'string<))))
       (epkgs [name class] 'epkg-mirrored-package--eieio-childp))))
#+END_SRC
[[https://emacsmirror.net/stats][up]]
* Feature kludges
** join provided
- *Revisit*
  - bbdb
  - emacs
  - eshell
  - ess
  - finder
  - geiser
  - mu4e
  - navi2ch
  - org-toodledo
  - realgud
  - riece
  - ucs-utils
  - wanderlust
  - wisi
- *Permanent:* rejected
  - sly [[https://github.com/capitaomorte/sly/pull/85][capitaomorte/sly#85]]
- *Permanent:* generated at built-time
  - notmuch
- *Permanent:* internal ignored test files
  - jdee: jdee-test
  - org: org-test
  - org-toodledo: org-toodledo-test
#+NAME: provided-join
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Feature")
    (epkg-sql [:select [name class feature]
               :from [packages provided]
               :where (and (= name package)
                           (= join 't))
               :order-by [(asc package) (asc feature)]]))
#+END_SRC
#+RESULTS: provided-join
| Package      | Type     | Feature             |
|--------------+----------+---------------------|
| bbdb         | git      | bbdb-site           |
| emacs        | builtin  | cus-load            |
| emacs        | builtin  | leim-list           |
| eshell       | builtin  | esh-groups          |
| ess          | github   | essddr              |
| finder       | builtin  | finder-inf          |
| geiser       | github   | geiser-install      |
| geiser       | github   | geiser-load         |
| mu4e         | github   | mu4e-meta           |
| navi2ch      | github   | navi2ch-config      |
| notmuch      | git      | notmuch-version     |
| org-toodledo | github   | org-toodledo-test   |
| realgud      | github   | bashdb              |
| riece        | git      | riece-package-info  |
| sly          | github   | sly-buttons         |
| sly          | github   | sly-common          |
| sly          | github   | sly-completion      |
| sly          | github   | sly-messages        |
| sly          | github   | sly-parse           |
| sly          | github   | sly-tests           |
| ucs-utils    | github   | ucs-utils-6.0-delta |
| wanderlust   | orphaned | wl-news             |
| wisi         | elpa     | wisi-compat-24.2    |

** drop provided
- *Todo:* bundle ert
  - bury-successful-compilation
  - codex
  - fabric
  - ghost-blog
  - git
  - irony
  - markup
  - navi2ch
  - php+-mode
  - phpunit
  - pony-mode
  - unkillable-scratch
- *Todo:* bundle el-expectations
  - cake-inflector, cake2, historyf
  - helm-rails
- *Todo:* bundle mocker
  - ein
  - pow
- *Todo:* bundle shelved elunit
  - jump
  - rinari
- *Todo:* provide init
  - ac-anaconda, anaconda-mode, company-anaconda, company-tern
- *Todo:* provide test-helper
  - total of 69 packages!
- *Todo:* misc bundled libraries
  - bitbake
  - cerbere
  - diffscuss-mode
  - evil-smartparens
  - find-file-in-project
  - flim
  - google-this
  - malabar-mode
  - ph
  - repo
  - wordnut
- *Revisit*
  - apel, flim, semi, wanderlust
  - confluence
  - coq
  - ddskk
  - levenshtein
  - nxhtml
  - php+-mode
  - tuareg
  - twittering-mode: necessary for Emacs v21 support
  - vm
- *Pending*
  - anything-project [[https://github.com/imakado/anything-project/pull/3][#3]] (no reply)
  - emacspeak [[https://github.com/tvraman/emacspeak/pull/15][#15]]
  - eyuml, helm-backup [[https://github.com/antham/helm-backup/issues/22][helm-backup#22]]
  - floobits [[https://github.com/Floobits/floobits-emacs/pull/86][#86]] (no reply)
  - font-lock-regression-suite [[https://github.com/Lindydancer/font-lock-studio/issues/2][font-lock-studio#2]]
  - lookup [[https://github.com/lookup2/lookup2/pull/14][#14]]
  - mailcrypt [[https://github.com/barak/mailcrypt/pull/1][#1]]
  - psgml [[https://github.com/lenst/psgml/issues/1][#1]]
  - nav [[https://github.com/ijt/emacs-nav/pull/103][#103]]
  - org (drop htmlize)
  - org [[https://github.com/ensime/emacs-scala-mode/pull/107#issuecomment-222553618][scala-mode/#107]], [[https://github.com/ensime/emacs-scala-mode/issues/114][#114]]
  - project-root [[https://bitbucket.org/piranha/project-root/pull-requests/1/remove-bundled-find-cmdel/diff][#1]]
  - slime, sly [[https://github.com/capitaomorte/sly/issues/92][sly#92]]
- *Permanent*: misc
  - (a) bundle ert: cask, commander, drag-stuff, ecukes, espuds,
    ruby-end, wrap-region (b) provide dummy-package: epl, flycheck (c)
    flycheck provides many fake libraries.  In the past this upstream
    rejected my feature releated suggestions.  I don't feel like
    trying again.
  - wanderlust [[https://github.com/wanderlust/wanderlust/issues/139][#139]] bbdb-wl.el is for compatibility with older bbdb
    versions.  It's the only file that requires bbdb.  bbdb v3 comes
    with wanderlust support.
- *Permanent:* rejected
  - go: upstream reverted my fix [[https://github.com/eschulte/el-go/commit/ff45fb44d9cb6579d8511d8b6156ed0b34d5ac97#commitcomment-19895084][ff45fb44]]
  - mic-paren: upstream considers it to be a drop-in replacement
  - palette: upstream considers it to be a drop-in replacement
  - mkhtml: upstream considers it to be a drop-in replacement
#+NAME: provided-drop
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Feature")
    (epkg-sql [:select [name class feature]
               :from [packages provided]
               :where (and (= name package)
                           (notnull drop))
               :order-by [(asc package) (asc feature)]]))
#+END_SRC
#+RESULTS: provided-drop
| Package                     | Type     | Feature                        |
|-----------------------------+----------+--------------------------------|
| ac-anaconda                 | github   | init                           |
| ag                          | github   | test-helper                    |
| alchemist                   | github   | test-helper                    |
| amd-mode                    | github   | test-helper                    |
| ample-regexps               | github   | test-helper                    |
| anaconda-mode               | github   | init                           |
| anaconda-mode               | github   | test-helper                    |
| anything-project            | github   | anything                       |
| anything-project            | github   | anything-match-plugin          |
| apel                        | orphaned | custom                         |
| apel                        | orphaned | env                            |
| apel                        | orphaned | install                        |
| apel                        | orphaned | timezone                       |
| apel                        | orphaned | xemacs                         |
| basic-c-compile             | github   | test-helper                    |
| bitbake                     | github   | functional-test                |
| bury-successful-compilation | github   | ert                            |
| cake-inflector              | github   | el-expectations                |
| cake2                       | github   | el-expectations                |
| cask                        | github   | ert                            |
| cask-package-toolset        | github   | test-helper                    |
| celery                      | github   | test-helper                    |
| cerbere                     | github   | phpunit-test                   |
| cerbere                     | github   | test-helper                    |
| codex                       | github   | ert                            |
| coffee-mode                 | github   | test-helper                    |
| commander                   | github   | ert                            |
| company-anaconda            | github   | init                           |
| company-tern                | github   | init                           |
| company-tern                | github   | test-helper                    |
| confluence                  | orphaned | xml-rpc                        |
| coq                         | github   | maths-menu                     |
| coq                         | github   | mmm-auto                       |
| coq                         | github   | mmm-class                      |
| coq                         | github   | mmm-cmds                       |
| coq                         | github   | mmm-compat                     |
| coq                         | github   | mmm-cweb                       |
| coq                         | github   | mmm-mason                      |
| coq                         | github   | mmm-mode                       |
| coq                         | github   | mmm-region                     |
| coq                         | github   | mmm-rpm                        |
| coq                         | github   | mmm-sample                     |
| coq                         | github   | mmm-univ                       |
| coq                         | github   | mmm-utils                      |
| coq                         | github   | mmm-vars                       |
| cpanfile-mode               | github   | test-helper                    |
| ddskk                       | github   | install                        |
| ddskk                       | github   | ptexinfmt                      |
| ddskk                       | github   | vip                            |
| diffscuss-mode              | subtree  | test-simple                    |
| dionysos                    | github   | test-helper                    |
| drag-stuff                  | github   | ert                            |
| dumb-jump                   | github   | test-helper                    |
| ecukes                      | github   | ert                            |
| edbi-database-url           | github   | test-helper                    |
| edbi-django                 | github   | test-helper                    |
| ein                         | github   | mocker                         |
| elisp-refs                  | github   | test-helper                    |
| elixir-mode                 | github   | test-helper                    |
| emacspeak                   | github   | amixer                         |
| emacspeak                   | github   | nm                             |
| emacspeak                   | github   | tetris                         |
| emojify                     | github   | test-helper                    |
| emr                         | github   | test-helper                    |
| epl                         | github   | dummy-package                  |
| espuds                      | github   | ert                            |
| evil-smartparens            | github   | evil-tests                     |
| evil-snipe                  | github   | test-helper                    |
| eyuml                       | github   | env                            |
| fabric                      | github   | ert                            |
| fabric                      | github   | test-helper                    |
| find-file-in-project        | github   | ivy                            |
| fireplace                   | github   | test-helper                    |
| flim                        | orphaned | hex-util                       |
| flim                        | orphaned | hmac-def                       |
| flim                        | orphaned | hmac-md5                       |
| flim                        | orphaned | hmac-sha1                      |
| flim                        | orphaned | luna                           |
| flim                        | orphaned | lunit                          |
| flim                        | orphaned | md4                            |
| flim                        | orphaned | md5                            |
| flim                        | orphaned | ntlm                           |
| flim                        | orphaned | sasl                           |
| flim                        | orphaned | sasl-anonymous                 |
| flim                        | orphaned | sasl-cram                      |
| flim                        | orphaned | sasl-digest                    |
| flim                        | orphaned | sasl-login                     |
| flim                        | orphaned | sasl-ntlm                      |
| flim                        | orphaned | sasl-plain                     |
| flim                        | orphaned | sasl-scram                     |
| flim                        | orphaned | sha1                           |
| flim                        | orphaned | smtpmail                       |
| floobits                    | github   | highlight                      |
| flycheck                    | github   | checkdoc-elisp-mode-regression |
| flycheck                    | github   | compressed                     |
| flycheck                    | github   | dummy-package                  |
| flycheck                    | github   | dummy-package-autoloads        |
| flycheck                    | github   | errors-and-warnings            |
| flycheck                    | github   | warnings                       |
| font-lock-regression-suite  | github   | files                          |
| font-lock-regression-suite  | github   | remote-wildcards               |
| ghost-blog                  | github   | ert                            |
| git                         | github   | ert                            |
| gitlab                      | github   | test-helper                    |
| go                          | github   | gnugo                          |
| go-eldoc                    | github   | test-helper                    |
| google-this                 | github   | noflet                         |
| gotest                      | github   | test-helper                    |
| helm-backup                 | github   | env                            |
| helm-company                | github   | test-helper                    |
| helm-rails                  | github   | ert-expectations               |
| historyf                    | github   | el-expectations                |
| ido-ubiquitous              | github   | test-helper                    |
| irony                       | github   | ert                            |
| jump                        | github   | elunit                         |
| karma                       | github   | test-helper                    |
| literate-coffee-mode        | github   | test-helper                    |
| lookup                      | github   | stem-english                   |
| loop                        | github   | test-helper                    |
| mailcrypt                   | github   | timer                          |
| malabar-mode                | github   | elk-test                       |
| marcopolo                   | github   | test-helper                    |
| markdown-toc                | github   | test-helper                    |
| markdownfmt                 | github   | test-helper                    |
| markup                      | github   | ert                            |
| matrix-client               | git      | test-helper                    |
| mic-paren                   | file     | paren                          |
| mkhtml                      | wiki     | htmlize                        |
| mu4e-alert                  | github   | test-helper                    |
| nav                         | github   | ack                            |
| navi2ch                     | github   | ert                            |
| nxhtml                      | orphaned | ack                            |
| nxhtml                      | orphaned | anchored-transpose             |
| nxhtml                      | orphaned | csharp-mode                    |
| nxhtml                      | orphaned | edit-server                    |
| nxhtml                      | orphaned | fold-dwim                      |
| nxhtml                      | orphaned | html-toc                       |
| nxhtml                      | orphaned | http-post-simple               |
| nxhtml                      | orphaned | iss-mode                       |
| nxhtml                      | orphaned | markchars                      |
| nxhtml                      | orphaned | moz                            |
| nxhtml                      | orphaned | org-panel                      |
| nxhtml                      | orphaned | outline-magic                  |
| nxhtml                      | orphaned | php-mode                       |
| nxhtml                      | orphaned | pointback                      |
| nxhtml                      | orphaned | powershell-mode                |
| nxhtml                      | orphaned | rnc-mode                       |
| nxhtml                      | orphaned | smarty-mode                    |
| nxhtml                      | orphaned | tt-mode                        |
| nxhtml                      | orphaned | visual-basic-mode              |
| nxhtml                      | orphaned | vline                          |
| nxhtml                      | orphaned | zencoding-mode                 |
| omni-log                    | github   | test-helper                    |
| omni-quotes                 | github   | test-helper                    |
| omni-scratch                | github   | test-helper                    |
| omni-tags                   | github   | test-helper                    |
| opensource                  | github   | test-helper                    |
| org                         | git      | htmlize                        |
| org                         | git      | ob-scala                       |
| org-doing                   | github   | test-helper                    |
| org-sync                    | github   | test-helper                    |
| org-trello                  | github   | test-helper                    |
| org2jekyll                  | github   | test-helper                    |
| overseer                    | github   | test-helper                    |
| palette                     | wiki     | eyedropper                     |
| paradox                     | github   | test-helper                    |
| ph                          | github   | tdd-helper                     |
| php+-mode                   | github   | ert                            |
| php+-mode                   | github   | ert-tests                      |
| php+-mode                   | github   | ert-x                          |
| php+-mode                   | github   | ert-x-tests                    |
| php+-mode                   | github   | php-completion                 |
| php+-mode                   | github   | php-doc                        |
| php+-mode                   | github   | php-string                     |
| php+-mode                   | github   | string-utils                   |
| phpunit                     | github   | ert                            |
| phpunit                     | github   | test-helper                    |
| pony-mode                   | github   | ert                            |
| pow                         | github   | mocker                         |
| prodigy                     | github   | test-helper                    |
| projmake-mode               | github   | elisp-lint                     |
| psgml                       | github   | sgml-mode                      |
| pythonic                    | github   | test-helper                    |
| racer                       | github   | test-helper                    |
| refine                      | github   | test-helper                    |
| relative-buffers            | github   | test-helper                    |
| repo                        | github   | functional-test                |
| resize-window               | github   | test-helper                    |
| restart-emacs               | github   | test-helper                    |
| rinari                      | github   | elunit                         |
| ripgrep                     | github   | test-helper                    |
| ruby-end                    | github   | ert                            |
| semi                        | orphaned | signature                      |
| sift                        | github   | test-helper                    |
| skeletor                    | github   | test-helper                    |
| slime                       | github   | cl-indent                      |
| sly                         | github   | cl-indent                      |
| smartparens                 | github   | test-helper                    |
| socyl                       | github   | test-helper                    |
| suggest                     | github   | test-helper                    |
| tco                         | github   | test-helper                    |
| tern-django                 | github   | test-helper                    |
| tox                         | github   | test-helper                    |
| travis                      | github   | test-helper                    |
| tuareg                      | github   | caml                           |
| twittering-mode             | github   | ssl                            |
| unkillable-scratch          | github   | ert                            |
| vdirel                      | github   | test-helper                    |
| vm                          | orphaned | org-vm                         |
| vm                          | orphaned | tapestry                       |
| vm                          | orphaned | vcard                          |
| wanderlust                  | orphaned | bbdb-wl                        |
| wanderlust                  | orphaned | ptexinfmt                      |
| wanderlust                  | orphaned | rfc2368                        |
| wanderlust                  | orphaned | ssl                            |
| wanderlust                  | orphaned | utf7                           |
| widget-mvc                  | github   | test-helper                    |
| window-purpose              | github   | test-helper                    |
| wordnut                     | github   | tdd-helper                     |
| wrap-region                 | github   | ert                            |

** drop required
- *Revisit*
- *Pending*
  - aozora-view [[https://github.com/kawabata/aozora-view/issues/3][#3]]
  - haml-mode [[https://github.com/nex3/haml-mode/issues/34][#34]], [[https://github.com/nex3/haml-mode/pull/35][#35]]
  - lispxmp: asked by email
  - rpm-spec-mode [[https://github.com/stigbjorlykke/rpm-spec-mode/pull/11][#11]]
  - slime, sly, ilisp (shelved) [[https://github.com/capitaomorte/sly/issues/86][capitaomorte/sly#86]]
- *Permanent:* misc
  - cask-package-toolset: bogus dependency
  - color-moccur: ~ee~ support is optional. ~ee~ depends on ~edb~.  Some of
    the ~edb~ libraries require the feature ~edbcore~, but none of its
    libraries actually provides that feature.
  - ddskk: jisx0213 is for backward compatibility
  - ecb: backward compatibility [[https://github.com/ecb-home/ecb/issues/24][#24]]
  - es-lib [[https://github.com/sabof/es-lib/issues/3][#3]], project-explorer: [[https://github.com/sabof/project-explorer/issues/47][#47]] ack-and-a-half was removed due to
    license violations.  Some parts of these packages break when that
    isn't available, but the libraries are still loadable.
  - ess: rtf-support is only available in xemacs
  - el-autoyas, extend-dnd, r-autoyas: backward compatibility [[https://github.com/mattfidler/el-autoyas.el/issues/4][#4]]
  - guix: these libraries are provided by GuixSD itself
  - hyperbole: I have emailed the author.  ~efs~ is an XEmacs package,
    on Emacs ~tramp~ is used instead.  The author also says that
    ~id-menubars~ and ~x-mouse~ are not hard dependencies and that he will
    eventually make them available again.  I expect "eventually" to
    take a long time.
  - jdee: The stand-alone ~cedet~ version contains ~working~ but the
    built-in version does not.  ~jdee~ defines defines the functions
    from ~working~ that it uses itself if the library cannot be
    loaded.
  - lilypond: ilisp wasn't touched in over a decade and is only
    required by a single, undocumented, command
  - malabar-mode: only required by obsolete version in src.old/.
  - matlab-mode: backward compatibility
  - org-readme: [[https://github.com/mattfidler/org-readme/issues/19][#19]] backward compatibility
  - python-mode: pymacs is unmaintained but a copy is bundled with
    python-mode.  py-load-pymacs does "Load Pymacs as delivered with
    python-mode.el", so even though I could not find (provide 'pymacs)
    anywhere but did find (require 'pymacs), I am going to assume that
    somehow that feature is made available by python-mode itself.
    Also mailed the maintainer about this.
  - mew: mw32script is only required when using the Meadow Emacs fork.
  - twittering-mode: ~alpaca~ is only used if ~epa~ isn't available, and
    ~unicode~ is required to work around an old and long-since fixed bug.
  - w3: x-font-menu, xbm-button, xpm-button are for XEmacs; dtk-voices
    used to be part of emacspeaks and not needed
  - wanderlust [[https://github.com/wanderlust/wanderlust/issues/139][#139]] bbdb-wl.el is for compatibility with older bbdb
    versions.  It's the only file that requires bbdb.  bbdb v3 comes
    with wanderlust support.
- *Permanent:* internal autoloads
  - ddskk: skk-autoloads, nicola-ddskk-autoloads
  - vm: vm-autoloads
- *Permanent:* external autoloads
  - bbdb: vm-autoloads
#+NAME: required-drop
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Feature" "Drop")
    (epkg-sql [:select [name class feature drop]
               :from [packages required]
               :where (and (= name package)
                           (notnull drop))
               :order-by [(asc package) (asc feature)]]))
#+END_SRC
#+RESULTS: required-drop
| Package                         | Type        | Feature                | Drop   |
|---------------------------------+-------------+------------------------+--------|
| ac-octave                       | github      | octave-inf             | global |
| ada-mode                        | elpa        | ada-mode-compat-24.2   | t      |
| aozora-view                     | github      | ivs-aj1                | t      |
| auto-complete                   | github      | semantic-ia            | t      |
| bbdb                            | git         | vm-autoloads           | t      |
| cask-package-toolset            | github      | ${package-name}        | t      |
| color-moccur                    | github      | ee-autoloads           | t      |
| color-theme-sanityinc-solarized | github      | color-theme            | global |
| color-theme-sanityinc-tomorrow  | github      | color-theme            | global |
| color-theme-solarized           | github      | color-theme            | global |
| company                         | github      | semantic-idle          | t      |
| coq                             | github      | atomic-extents         | t      |
| coq                             | github      | proof-x-symbol         | t      |
| ddskk                           | github      | balloon-help           | global |
| ddskk                           | github      | jisx0213               | t      |
| ddskk                           | github      | nicola-ddskk-autoloads | t      |
| ddskk                           | github      | skk-autoloads          | t      |
| dictionary                      | github      | balloon-help           | global |
| dired+                          | wiki        | help+20                | global |
| dired+                          | wiki        | subr-21                | global |
| doremi-cmd                      | wiki        | color-theme            | global |
| ecb                             | github      | semantic-analyze       | t      |
| ecb                             | github      | semantic-ctxt          | t      |
| ecb                             | github      | thing                  | global |
| efs                             | shelved     | view-less              | global |
| eide                            | git         | gdb-ui                 | t      |
| el-autoyas                      | github      | yasnippet-bundle       | t      |
| emacs-speaks-nonmem             | github      | org-publish            | t      |
| emacspeak                       | github      | org-exp                | t      |
| erlang                          | github      | tags                   | t      |
| es-lib                          | github      | ack-and-a-half         | t      |
| ess                             | github      | rtf-support            | t      |
| extend-dnd                      | github      | yasnippet-bundle       | t      |
| folding                         | github      | mode-motion            | global |
| folio                           | shelved     | color-theme            | global |
| gnuplot                         | github      | toolbar                | global |
| gnus                            | builtin     | un-define              | global |
| guix                            | github      | guix-build-config      | t      |
| guix                            | github      | guix-emacs             | t      |
| help+                           | wiki        | info+20                | global |
| hyperbole                       | git         | efs                    | t      |
| hyperbole                       | git         | id-menubars            | t      |
| hyperbole                       | git         | x-mouse                | t      |
| icicles                         | wiki        | color-theme            | global |
| jabber                          | git         | un-define              | global |
| jdee                            | github      | working                | t      |
| lacarte                         | wiki        | subr-21                | global |
| lilypond                        | git         | ilisp                  | t      |
| lispxmp                         | wiki        | newxmp                 | t      |
| load-theme-buffer-local         | github      | color-theme            | global |
| malabar-mode                    | github      | cc-subword             | t      |
| malabar-mode                    | github      | semantic-ctxt          | t      |
| malabar-mode                    | github      | semantic-find          | t      |
| malabar-mode                    | github      | semantic-ia            | t      |
| malabar-mode                    | github      | semantic-load          | t      |
| malabar-mode                    | github      | semantic-wisent        | t      |
| malabar-mode                    | github      | semanticdb-search      | t      |
| malabar-mode                    | github      | srecode-getset         | t      |
| malabar-mode                    | github      | srecode-map            | t      |
| malabar-mode                    | github      | wisent-java            | t      |
| matlab-mode                     | git         | semantic-dep           | t      |
| matlab-mode                     | git         | semantic-format        | t      |
| matlab-mode                     | git         | semanticdb             | t      |
| matlab-mode                     | git         | srecode-map            | t      |
| menu-bar+                       | wiki        | help+20                | global |
| menu-bar+                       | wiki        | info+20                | global |
| mew                             | github      | mw32script             | t      |
| mew                             | github      | un-define              | global |
| mh-e                            | builtin     | toolbar                | global |
| mhc                             | github      | bitmap                 | global |
| mhc                             | github      | mhc-bm                 | t      |
| mhc                             | github      | mhc-xmas               | t      |
| mhc                             | github      | pcustom                | t      |
| mhc                             | github      | poe                    | t      |
| mkhtml                          | wiki        | info+20                | global |
| molokai-theme                   | github      | color-theme            | global |
| navi2ch                         | github      | bitmap                 | global |
| notes-mode                      | elpa        | npgp                   | t      |
| notes-mode                      | elpa        | pam                    | t      |
| org                             | git         | org-publish            | t      |
| org                             | git         | org-remember           | t      |
| org-caldav                      | github      | org-icalendar          | t      |
| org-readme                      | github      | org-html               | t      |
| ox-pukiwiki                     | github      | org-test               | t      |
| ox-textile                      | github      | org-test               | t      |
| po-mode                         | minority    | po-compat              | t      |
| project-explorer                | github      | ack-and-a-half         | t      |
| python-mode                     | gitlab      | pymacs                 | t      |
| r-autoyas                       | github      | yasnippet-bundle       | t      |
| rpm-spec-mode                   | github      | shindent               | t      |
| scroll-1                        | shelved     | view-less              | global |
| semi                            | orphaned    | bitmap                 | global |
| slamhound                       | shelved     | slam.hound             | t      |
| slime                           | github      | hyperspec              | t      |
| sly                             | github      | hyperspec              | t      |
| tangotango-theme                | github      | color-theme            | global |
| tc                              | github      | bitmap                 | global |
| twittering-mode                 | github      | alpaca                 | t      |
| twittering-mode                 | github      | un-define              | global |
| twittering-mode                 | github      | unicode                | t      |
| vcl-mode                        | github      | generic-mode           | global |
| vm                              | orphaned    | vm-autoloads           | t      |
| w3                              | elpa-branch | dtk-voices             | t      |
| w3                              | elpa-branch | w3-site-init           | t      |
| w3                              | elpa-branch | x-font-menu            | t      |
| w3                              | elpa-branch | xbm-button             | t      |
| w3                              | elpa-branch | xpm-button             | t      |
| w3m                             | orphaned    | un-define              | global |
| wanderlust                      | orphaned    | bbdb                   | t      |
| wanderlust                      | orphaned    | bbdb-com               | t      |
| wanderlust                      | orphaned    | bbdb-hooks             | t      |
| wanderlust                      | orphaned    | bitmap                 | global |
| xwem                            | shelved     | view-less              | global |
| yatex                           | hg          | hilit19                | t      |

** ease required
#+NAME: required-ease
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Feature")
    (epkg-sql [:select [name class feature]
               :from [packages required]
               :where (and (= name package)
                           (notnull ease))
               :order-by [(asc package) (asc feature)]]))
#+END_SRC
#+RESULTS: required-ease
| Package | Type | Feature           |
|---------+------+-------------------|
| org     | git  | inferior-picolisp |
| org     | git  | matlab            |

* Forced main library
- *Pending:* two-variant themes
  - farmhouse-theme [[https://github.com/mattly/emacs-farmhouse-theme/pull/3][#3]]
  - majapahit-theme [[https://gitlab.com/franksn/majapahit-theme/merge_requests/1][#1]]
  - punpun-theme [[https://github.com/wasamasa/punpun-theme/pull/7][#7]]
  - spacemacs-theme [[https://github.com/nashamri/spacemacs-theme/pull/63][#63]]
  - tao-theme [[https://github.com/11111000000/tao-theme-emacs/pull/17][#17]]
- *Stalled:* Gelpa
  - ada-ref-man [[http://debbugs.gnu.org/cgi/bugreport.cgi?bug=24517][debbugs#24517]]
  - uni-confusables [[http://debbugs.gnu.org/cgi/bugreport.cgi?bug=24517][debbugs#24517]]
- *Permanent:* misc
  - auctex: to late to change this now
  - ddskk: upstream rejected the idea of consistent naming
  - ert-runner: [[https://github.com/rejeep/ert-runner.el/pull/16][#16]] rejected because it's not a library
  - literate-starter-kit: not a package but in Melpa
- *Permanent:* no properly named main library
  - emacs-speaks-nonmem
  - emux
  - html5
  - ne2wm
  - ultratex
- *Permanent:* related packages, no primary entry point, pick one
  - chumpy-windows
  - dired-hacks
#+NAME: no-mainlib
#+BEGIN_SRC emacs-lisp
  (emir--with-org-header ("Package" "Type" "Library")
    (epkg-sql [:select [name class library] :from packages
               :where (notnull library)
               :and class :in $v1
               :order-by [(asc name)]]
              (closql--where-class-in
               (epkg-db)
               'epkg-mirrored-package--eieio-childp)))
#+END_SRC
#+RESULTS: no-mainlib
| Package              | Type        | Library                 |
|----------------------+-------------+-------------------------|
| ada-ref-man          | elpa        | ada-ref-man.el          |
| auctex               | elpa-branch | tex.el                  |
| chumpy-windows       | github      | window-jump.el          |
| ddskk                | github      | skk.el                  |
| dired-hacks          | github      | dired-hacks-utils.el    |
| emacs-speaks-nonmem  | github      | esn-start.el            |
| emux                 | github      | emux-base.el            |
| ert-runner           | github      | ert-runner.el           |
| eziam-theme          | github      | eziam-dark-theme.el     |
| farmhouse-theme      | github      | farmhouse-dark-theme.el |
| html5                | github      | html5-ncr.el            |
| literate-starter-kit | github      | init.el                 |
| majapahit-theme      | gitlab      | majapahit-dark-theme.el |
| ne2wm                | github      | ne2wm-setup.el          |
| punpun-theme         | github      | punpun-dark-theme.el    |
| spacemacs-theme      | github      | spacemacs-dark-theme.el |
| tao-theme            | github      | tao-yang-theme.el       |
| ultratex             | github      | lisp/ultex.el           |
| uni-confusables      | elpa        | uni-confusables.el      |

* Features provided by multiple packages
** excluding shelved
#+NAME: conflicts
#+BEGIN_SRC emacs-lisp
  (emir--provide-issues t)
#+END_SRC
#+RESULTS: conflicts

** including shelved
#+NAME: conflicts-shelved
#+BEGIN_SRC emacs-lisp
  (emir--provide-issues nil)
#+END_SRC
#+RESULTS: conflicts-shelved
| Feature               | Package              | Shelved |
|-----------------------+----------------------+---------|
| alert                 | alert                |         |
| alert                 | protocolarium        | t       |
| anything              | anything             |         |
| anything              | auto-complete-acr    | t       |
| anything              | symfony              | t       |
| anything-config       | anything             |         |
| anything-config       | auto-complete-acr    | t       |
| anything-grep         | anything             |         |
| anything-grep         | symfony              | t       |
| anything-match-plugin | anything             |         |
| anything-match-plugin | symfony              | t       |
| anything-project      | anything-project     |         |
| anything-project      | symfony              | t       |
| auto-complete         | auto-complete        |         |
| auto-complete         | symfony              | t       |
| beanshell             | csde                 | t       |
| beanshell             | jdee                 |         |
| bridge                | ilisp                | t       |
| bridge                | slime                |         |
| bufcomp               | light                | t       |
| bufcomp               | ultratex             |         |
| comint                | emacs                |         |
| comint                | rexx-mode            | t       |
| csharp-mode           | csharp-mode          |         |
| csharp-mode           | idebridge            | t       |
| cust-stub             | cust-stub            | t       |
| cust-stub             | efs                  | t       |
| devices               | gnuserv              | t       |
| devices               | w3                   |         |
| dotassoc              | dotassoc             | t       |
| dotassoc              | kv                   |         |
| dropdown-list         | auto-complete-acr    | t       |
| dropdown-list         | dropdown-list        |         |
| easymenu              | emacs                |         |
| easymenu              | tla-mode             | t       |
| ecasound              | ecasound             |         |
| ecasound              | xiomacs              | t       |
| el-expectations       | el-expectations      |         |
| el-expectations       | symfony              | t       |
| el-mock               | el-mock              |         |
| el-mock               | symfony              | t       |
| elunit                | dvc                  | t       |
| elunit                | elunit               | t       |
| erlext                | distel               |         |
| erlext                | shbuf                | t       |
| ert                   | ert                  |         |
| ert                   | mode-line-in-header  | t       |
| ess-R-object-popup    | auto-complete-acr    | t       |
| ess-R-object-popup    | ess-R-object-popup   |         |
| ewoc                  | dvc                  | t       |
| ewoc                  | ewoc                 |         |
| haskell               | haskell              | t       |
| haskell               | haskell-mode         |         |
| htmlize               | htmlize              |         |
| htmlize               | simple-server        | t       |
| http-headers          | http-headers         | t       |
| http-headers          | know-your-http-well  |         |
| httpd                 | muse                 |         |
| httpd                 | simple-server        | t       |
| inflections           | emacs-rails          | t       |
| inflections           | jump                 |         |
| iterator              | iterator             |         |
| iterator              | traverselisp         | t       |
| jack                  | emms                 |         |
| jack                  | xiomacs              | t       |
| javascript-mode       | javascript-mode      | t       |
| javascript-mode       | mdee                 | t       |
| js                    | espresso             | t       |
| js                    | js                   |         |
| later-do              | emms                 |         |
| later-do              | later-do             | t       |
| lazy-lock             | emacs                |         |
| lazy-lock             | mupacs               | t       |
| light                 | light                | t       |
| light                 | ultratex             |         |
| lui                   | circe                |         |
| lui                   | elim                 | t       |
| lui                   | lui                  | t       |
| mail-reorder-headers  | mail-reorder-headers | t       |
| mail-reorder-headers  | order-head           |         |
| matlab-publish        | matlab-mode          |         |
| matlab-publish        | matlab-publish       | t       |
| mew                   | mew                  |         |
| mew                   | x-face               | t       |
| multi-mode            | litprog              | t       |
| multi-mode            | multi-mode           |         |
| notify                | elim                 | t       |
| notify                | notify               |         |
| noweb                 | litprog              | t       |
| noweb                 | noweb                |         |
| php-completion        | php-completion       |         |
| php-completion        | symfony              | t       |
| php-mode              | desktop-recover      | t       |
| php-mode              | php-mode             |         |
| php-mode              | symfony              | t       |
| pomodoro              | pomodoro             |         |
| pomodoro              | protocolarium        | t       |
| refactor              | gauche-ext           | t       |
| refactor              | refactor             | t       |
| reporter              | reporter             |         |
| reporter              | tla-mode             | t       |
| rijndael              | elgyach              | t       |
| rijndael              | rijndael             |         |
| setnu                 | csde                 | t       |
| setnu                 | setnu                |         |
| snippet               | pases                | t       |
| snippet               | snippet              |         |
| spread                | protocolarium        | t       |
| spread                | spread               |         |
| stack-f               | elib                 | t       |
| stack-f               | emacspeak            |         |
| stem                  | sdic                 | t       |
| stem                  | stem                 |         |
| tagging               | free-tagging         | t       |
| tagging               | tagging              | t       |
| test                  | test                 | t       |
| test                  | twittering-mode      |         |
| test-framework        | test-framework       |         |
| test-framework        | vimpulse             | t       |
| texi-docstring-magic  | coq                  |         |
| texi-docstring-magic  | texi-docstring-magic | t       |
| textmate              | peepopen             | t       |
| textmate              | textmate             |         |
| timeclock             | planner              | t       |
| timeclock             | timeclock            |         |
| tracking              | circe                |         |
| tracking              | elim                 | t       |
| tree-mode             | pases                | t       |
| tree-mode             | tree-mode            |         |
| units                 | cpad                 | t       |
| units                 | units                | t       |
| uuidgen               | folio                | t       |
| uuidgen               | uuidgen              |         |
| vc                    | emtest               | t       |
| vc                    | vc                   |         |
| websocket             | wave-client          | t       |
| websocket             | websocket            |         |
| winsize               | nxhtml               |         |
| winsize               | winsize              | t       |
| xml-parse             | doxymacs             | t       |
| xml-parse             | xml-parse            |         |
| xml-rpc               | elserv               | t       |
| xml-rpc               | xml-rpc              |         |
| yasnippet             | auto-complete-acr    | t       |
| yasnippet             | yasnippet            |         |

* Unsatisfied dependencies
** hard dependencies
- *Todo*
  - apel
  - vm
- *Pending*
  - bts [[https://github.com/aki2o/emacs-bts/issues/16][#16]]
  - malabar-mode [[https://github.com/m0smith/malabar-mode/issues/189][#189]]
#+NAME: unsatisfied-hard
#+BEGIN_SRC emacs-lisp
  (emir--require-issues (lambda (feature)
                          (not (epkg-provided-by feature)))
                        '((= hard 't) (isnull drop)))
#+END_SRC
#+RESULTS: unsatisfied-hard
| Package      | Type     | Melpa  | Feature           |
|--------------+----------+--------+-------------------|
| apel         | orphaned | github | tcp               |
| apel         | orphaned | github | timer-funcs       |
| bts          | github   | github | tenv              |
| malabar-mode | github   | github | ede/maven2        |
| malabar-mode | github   | github | semantic/db-javap |
| vm           | orphaned |        | atomic-extents    |
| vm           | orphaned |        | highlight-headers |
| vm           | orphaned |        | timer-funcs       |

** soft dependencies
- *Todo*
  - nxhtml
#+NAME: unsatisfied-soft
#+BEGIN_SRC emacs-lisp
  (emir--require-issues (lambda (feature)
                          (not (epkg-provided-by feature)))
                        '((isnull hard) (isnull drop)))
#+END_SRC
#+RESULTS: unsatisfied-soft
| Package | Type     | Melpa | Feature      |
|---------+----------+-------+--------------|
| nxhtml  | orphaned |       | company-mode |
| nxhtml  | orphaned |       | emacsw32     |
| nxhtml  | orphaned |       | flymake-js   |
| nxhtml  | orphaned |       | typesetter   |
| nxhtml  | orphaned |       | w32-regdat   |
| nxhtml  | orphaned |       | w32shell     |

* Dependent on shelved packages
** hard dependencies
#+NAME: required-shelved-hard
#+BEGIN_SRC emacs-lisp
  ;; (emir--require-issues (lambda (feature)
  ;;                         (--when-let (epkg-provided-by feature)
  ;;                           (epkg-shelved-package-p (epkg it))))
  ;;                       '((= hard 't) (isnull drop)))
#+END_SRC
#+RESULTS: required-shelved-hard

** soft dependencies
#+NAME: required-shelved-soft
#+BEGIN_SRC emacs-lisp
  ;; (emir--require-issues (lambda (feature)
  ;;                         (--when-let (epkg-provided-by feature)
  ;;                           (epkg-shelved-package-p (epkg it))))
  ;;                       '((isnull hard) (isnull drop)))
#+END_SRC
#+RESULTS: required-shelved-soft

